## Add column

In [1]:
import pandas as pd

df = pd.DataFrame([[1], [2]], columns = ['a'])
df['b'] = pd.Series([3, 4])
df

   a  b
0  1  3
1  2  4

## Add row

In [2]:
df = pd.DataFrame([[1, 2]], columns = ['a', 'b'])
df = df.append(pd.DataFrame([[3, 4]], columns = ['a', 'b']))

# Revise the index
df = df.reset_index(drop=True)
df

   a  b
0  1  2
1  3  4

## Delete column

In [3]:
df = pd.DataFrame([[1, 2, 3]], columns = ['a', 'b', 'c'])
df

   a  b  c
0  1  2  3

In [4]:
del df['a']
df.pop('c')
df

   b
0  2

## Delete row

In [5]:
df = pd.DataFrame([[1], [2]], columns = ['a'])
df = df.drop(1)
df

   a
0  1

## Merge & Group Data

In [6]:
# Concat
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy']})

two = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Bob', 'Tom']})

pd.concat([one, two]).reset_index(drop=True)

   id  Name
0   1  Alex
1   2   Amy
2   1   Bob
3   2   Tom

In [7]:
# Merge
one = pd.DataFrame({
    'id':[1, 2],
    'Name': ['Alex', 'Amy']})

two = pd.DataFrame({
    'id':[1, 2],
    'Score': [98, 60]})

pd.merge(one, two, on='id')

   id  Name  Score
0   1  Alex     98
1   2   Amy     60

In [8]:
pd.merge(one, two, how='left')

   id  Name  Score
0   1  Alex     98
1   2   Amy     60

In [9]:
# Join by index
one = pd.DataFrame({
    'Name': ['Alex', 'Amy']})

two = pd.DataFrame({
    'Score': [98, 60]})

one.join(two)

   Name  Score
0  Alex     98
1   Amy     60

In [10]:
# Group
df = pd.DataFrame({
  'A' : ['foo', 'bar', 'foo', 'bar'],
  'B' : ['one', 'one', 'two', 'three'],
  'C' : [1,2,3,4],
  'D' : [10, 20, 30, 40]})

df

     A      B  C   D
0  foo    one  1  10
1  bar    one  2  20
2  foo    two  3  30
3  bar  three  4  40

In [11]:
df.groupby('A').sum()

     C   D
A
bar  6  60
foo  4  40

In [12]:
df.groupby('A').agg(sum)

     C   D
A
bar  6  60
foo  4  40

In [13]:
df.groupby(['A', 'B']).sum()

           C   D
A   B
bar one    2  20
    three  4  40
foo one    1  10
    two    3  30